#!/usr/bin/env python
# -*- coding: utf-8 -*-
__author__ = 'Naleen'

import numpy as np

base_char = np.array([" ", "", "අ", "උ", "ඏ", "ඔ", "එ", "ළු", "ඉ", "ක", "ඛ", "ග", "ඝ", "ඟ", "ච", "ඡ", "ජ", "ඣ", "ඤ", "ඦ",
                      "ට", "ථ", "ඨ", "ධ", "ඩ", "ඪ", "ණ", "ඬ", "ත", "ද", "න", "ඳ", "ප", "ඵ", "බ", "භ", "ම",
                      "ඹ", "හ", "ය", "ර", "ල", "ව", "ශ", "ෂ", "ස", "ළ","ළු", "ෆ", "ඥ"])

upper_mod_char = np.array([" ", "", "ඕ", "ඒ", "කි", "කී", "ක්", "ඛි", "ඛී", "ඛ්", "ගි", "ගී", "ග්", "ඝි", "ඝී", "ඝ්", "ඟි", "ඟී", "ඟ්",
                           "ඡ්", "චි", "චී", "ච්", "ඡි", "ඡී", "ඣි", "ඣී", "ඣ්", "ජි", "ජී", "ජ්", "ඤි", "ඤී", "ඤ්", "ඦි", "ඦී",
                           "ඦ්", "ටි", "ටී", "ට්", "ථි", "ථී", "ථ්", "ඨි", "ඨී", "ඨ්", "ධි", "ධී", "ධ්", "ඩි", "ඩී", "ඩ්", "ඪි",
                           "ඪී", "ඪ්", "ණි", "ණී", "ණ්", "ඬි", "ඬී", "ඬ්", "ති", "තී", "ත්", "දි", "දී", "ද්", "නි", "නී", "න්",
                           "ඳි", "ඳී", "ඳ්", "පි", "පී", "ප්", "ඵි", "ඵී", "ඵ්", "බි", "බී", "බ්", "භි", "භී", "භ්", "මි", "මී",
                           "ම්", "ඹි", "ඹී", "ඹ්", "හි", "හී", "හ්", "ළ්", "යි", "යී", "ය්", "රි", "රී", "ර්", "ඊ", "ලි", "ලී",
                           "ල්", "වි", "වී", "ව්", "ශි", "ශී", "ශ්", "ෂි", "ෂී", "ෂ්", "සි", "සී", "ස්", "ළි", "ළී", "ෆි", "ෆී",
                           "ෆ්", "ඥි", "ඥී", "ඥ්"])

lower_mod_char = np.array([" ","", "කු", "කූ", "ක්‍ර", "ඛු", "ඛූ", "ගු", "ගූ", "ග්‍ර", "ඝු", "ඝූ", "ඝ්‍ර", "ඟු", "ඟූ", "ඡ්‍ර", "චු", "චූ",
                           "ච්‍ර", "ඡු", "ඡූ", "ඣු", "ඣූ", "ඣ්‍ර", "ජු", "ජූ", "ජ්‍ර", "ඤු", "ඤූ", "ඤ්‍ර", "ඦු", "ඦූ", "ඦ්‍ර",
                           "ටු", "ටූ", "ට්‍ර", "ථු", "ථූ", "ථ්‍ර", "ඨු", "ඨූ", "ඨ්‍ර", "ධු", "ධූ", "ධ්‍ර", "ඩු", "ඩූ", "ඩ්‍ර",
                           "ඪු", "ඪූ", "ඪ්‍ර", "ණු", "ණූ", "ණ්‍ර", "ඬු", "ඬූ", "ඬ්‍ර", "තු", "තූ", "ත්‍ර", "දු", "දූ", "ද්‍ර",
                           "නු", "නූ", "න්‍ර", "ඳු", "ඳූ", "ඳ්‍ර", "පු", "පූ", "ප්‍ර", "ඵු", "ඵූ", "ඵ්‍ර", "බු", "බූ", "බ්‍ර",
                           "භු", "භූ", "භ්‍ර", "මු", "මූ", "ම්‍ර", "ඹු", "ඹූ", "ඹ්‍ර", "හු", "හූ", "හ්‍ර", "යු", "යූ", "ය්‍ර",
                           "ලු", "ලූ", "ල්‍ර", "වු", "වූ", "ව්‍ර", "ශු", "ශූ", "ශ්‍ර", "ෂු", "ෂූ", "ෂ්‍ර", "සු", "සූ", "ස්‍ර",
                           "ෆු", "ෆූ", "ෆ්‍ර", "ඥු", "ඥූ", "ඥ්‍ර"])
right_mod = np.array([" ","",  "ා", "ක්‍ය", "ෘ", "ෳ", "ැ", "ෑ", "ඃ", "ං"])
left_mod = np.array([" ","", "ෙ"])

# print base_char.__contains__("උf")
# char_array=np.array([ "කෝ"])


